# HR及其他



### 工程相关

1. java语言怎么样
2. 大数据有没有做过
3. 项目中最大的难点
4. tensor(1, 2) 和tensor(2)有什么区别
5. tensorflow loss NAN一般可能原因，怎么解决
6. tensorflow debug工具
7. python yield
8. mapreduce用过嘛
9. 撕代码itemcf
10. 按召回原因计算点击率（用pandas）
11. 大数据这块工具会用么
12. python内存管理：引用计数，垃圾回收，分代回收
13. 引用计数有什么缺点
14. C++智能指针
15. 并发，多线程通信
16. python多线程，多进程适合IO密集型，计算密集型
17. 堆栈的区别
18. 内存分配
19. new delete
20. tensorflow的框架理念



### HR相关

1. 期望薪资
2. 意向城市
3. 未来规划
4. 自己的优缺点
5. 有么有跟进最新论文
6. 自我介绍
7. 工作期望
8. 薪资
9. 对公司的看法
10. 导师是谁，做什么方向
11. 目前的offer和进展中的公司，这几个公司的优先级
12. 怎么选择工作岗位
13. 团队背景，构成，分工，协调
14. 技术关注渠道，怎么学习技术
15. 性格，最成功的事，最大的挫折
16. 为什么选择上海，北京不够好嘛
17. 本科毕业到研究生入学期间做了什么
18. 实验室项目情况，怎么分工和沟通，有没有出现过摩擦或争执，怎么解决的
19. 竞赛中有什么影响比较深的挫折，经历了之后收获了是什么
20. 你认为你现在对这个工作岗位的优势有什么？有什么不足呢
21. 对第一份工作岗位有什么期待
22. 现在有什么offer,或者在面试流程中的公司，薪资怎么样，对上面几家公司，哪个和之前做的更匹配
23. 对于互联网产品有什么想法嘛，新的项目有什么看法